app/controllers/polls_controller.rb

SELECT  "polls".* FROM "polls" WHERE "polls"."id" = ? LIMIT 1  [["id", 1]]
---
  def upvote
  @poll = Poll.find(params[:id])

SELECT  "polls".* FROM "polls" WHERE "polls"."id" = ? LIMIT 1  [["id", 1]]
---
def downvote
  @poll = Poll.find(params[:id])

SELECT "polls".* FROM "polls"
---
  def index
    @polls = Poll.all

INSERT INTO "polls" ("title", "positive", "negative", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Who would win Tyson v Ali"], ["positive", "Tyson"], ["negative", "Ali"], ["created_at", "2015-11-30 23:55:26.483123"], ["updated_at", "2015-11-30 23:55:26.483123"]]
---
  def create
    @poll = Poll.new(poll_params)

    respond_to do |format|
      if @poll.save

UPDATE "polls" SET "image_file_name" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "polls"."id" = ?  [["image_file_name", "307762077_0204225344.jpg"], ["image_file_size", 66938], ["image_updated_at", "2015-12-02 17:37:19.893582"], ["updated_at", "2015-12-02 17:37:20.317355"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @poll.update(poll_params)

DELETE FROM "polls" WHERE "polls"."id" = ?  [["id", 2]]
---
  def destroy
    @poll.destroy

SELECT  "polls".* FROM "polls" WHERE "polls"."id" = ? LIMIT 1  [["id", 3]]
---
    def set_poll
      @poll = Poll.find(params[:id])